{"config": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 96, 96, 1], "trainable": true, "name": "zeropadding2d_1", "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "nb_filter": 32, "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "activation": "linear", "subsample": [1, 1], "name": "convolution2d_1", "W_constraint": null, "b_constraint": null, "bias": true, "W_regularizer": null, "nb_row": 3, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_2", "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "nb_filter": 64, "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "activation": "linear", "subsample": [1, 1], "name": "convolution2d_2", "W_constraint": null, "b_constraint": null, "bias": true, "W_regularizer": null, "nb_row": 3, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_3", "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "nb_filter": 128, "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "activation": "linear", "subsample": [1, 1], "name": "convolution2d_3", "W_constraint": null, "b_constraint": null, "bias": true, "W_regularizer": null, "nb_row": 3, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "activation": "linear", "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "output_dim": 64, "b_constraint": null, "bias": true, "W_regularizer": null, "name": "dense_1", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": null, "activation": "linear", "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "b_constraint": null, "bias": true, "W_regularizer": null, "name": "dense_2", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "name": "activation_5", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.2"}