{"keras_version": "1.1.1", "config": [{"config": {"batch_input_shape": [null, 96, 96, 1], "nb_col": 3, "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 32, "subsample": [1, 1], "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "input_dtype": "float32", "name": "convolution2d_29", "init": "glorot_uniform", "W_constraint": null, "trainable": true, "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_44", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_28", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 64, "subsample": [1, 1], "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "name": "convolution2d_30", "init": "glorot_uniform", "W_constraint": null, "trainable": true, "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_45", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_29", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "dim_ordering": "tf", "border_mode": "valid", "nb_filter": 128, "subsample": [1, 1], "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "name": "convolution2d_31", "init": "glorot_uniform", "W_constraint": null, "trainable": true, "b_constraint": null, "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_46", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_30", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_10", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "b_constraint": null, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "name": "dense_18", "init": "glorot_uniform", "W_constraint": null, "trainable": true, "output_dim": 64, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_47", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_constraint": null, "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "bias": true, "name": "dense_19", "init": "glorot_uniform", "W_constraint": null, "trainable": true, "output_dim": 1, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_48", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}