{"config": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "trainable": true, "name": "zeropadding2d_1", "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "trainable": true, "name": "convolution2d_1", "b_constraint": null, "activation": "linear", "init": "he_normal", "nb_row": 3, "W_regularizer": null, "bias": true, "border_mode": "same", "nb_filter": 32, "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_2", "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "trainable": true, "name": "convolution2d_2", "b_constraint": null, "activation": "linear", "init": "he_normal", "nb_row": 3, "W_regularizer": null, "bias": true, "border_mode": "same", "nb_filter": 64, "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_3", "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "trainable": true, "name": "convolution2d_3", "b_constraint": null, "activation": "linear", "init": "he_normal", "nb_row": 3, "W_regularizer": null, "bias": true, "border_mode": "same", "nb_filter": 128, "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_3", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_4", "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "trainable": true, "name": "convolution2d_4", "b_constraint": null, "activation": "linear", "init": "he_normal", "nb_row": 3, "W_regularizer": null, "bias": true, "border_mode": "same", "nb_filter": 256, "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_4", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_5", "padding": [1, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "trainable": true, "name": "convolution2d_5", "b_constraint": null, "activation": "linear", "init": "he_normal", "nb_row": 3, "W_regularizer": null, "bias": true, "border_mode": "same", "nb_filter": 512, "subsample": [1, 1], "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_5", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "trainable": true, "name": "dense_1", "b_constraint": null, "activation": "relu", "init": "he_normal", "W_regularizer": null, "bias": true, "input_dim": null, "W_constraint": null, "output_dim": 256, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "trainable": true, "name": "dense_2", "b_constraint": null, "activation": "relu", "init": "he_normal", "W_regularizer": null, "bias": true, "input_dim": null, "W_constraint": null, "output_dim": 64, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "trainable": true, "name": "dense_3", "b_constraint": null, "activation": "sigmoid", "init": "glorot_uniform", "W_regularizer": null, "bias": true, "input_dim": null, "W_constraint": null, "output_dim": 1, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}