{"class_name": "Sequential", "config": [{"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_1", "input_dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 32, "init": "glorot_uniform", "nb_col": 3, "bias": true, "activation": "linear", "border_mode": "valid", "nb_row": 3, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_2", "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "nb_col": 3, "bias": true, "activation": "linear", "border_mode": "valid", "nb_row": 3, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_3", "trainable": true, "b_regularizer": null, "b_constraint": null, "nb_filter": 128, "init": "glorot_uniform", "nb_col": 3, "bias": true, "activation": "linear", "border_mode": "valid", "nb_row": 3, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_3", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_1", "trainable": true, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "output_dim": 64, "activation": "linear", "input_dim": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_2", "trainable": true, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "bias": true, "output_dim": 2, "activation": "linear", "input_dim": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}}], "keras_version": "1.1.2"}