{"class_name": "Model", "keras_version": "1.1.2", "config": {"name": "model_2", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"input_dtype": "float32", "batch_input_shape": [null, 299, 299, 3], "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "name": "convolution2d_1", "activation": "relu", "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 32, "bias": true}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_1", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_1", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "name": "convolution2d_2", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 32, "bias": true}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_2", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_2", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_3", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_3", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_3", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "pool_size": [3, 3], "border_mode": "valid"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_4", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "name": "convolution2d_4", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 80, "bias": true}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_4", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_4", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "name": "convolution2d_5", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 192, "bias": true}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_5", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_5", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true, "pool_size": [3, 3], "border_mode": "valid"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_9", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_9", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_9", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_9", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_7", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 48, "bias": true}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_10", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_10", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 96, "bias": true}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_7", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_7", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_10", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_10", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_1", "config": {"strides": [1, 1], "dim_ordering": "tf", "name": "averagepooling2d_1", "trainable": true, "pool_size": [3, 3], "border_mode": "same"}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_6", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_6", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_8", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 5, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_11", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_11", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 96, "bias": true}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_12", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_12", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 32, "bias": true}, "inbound_nodes": [[["averagepooling2d_1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_6", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_6", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_8", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_8", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_11", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_11", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_12", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_12", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"class_name": "Merge", "name": "mixed0", "config": {"output_shape": null, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 3, "arguments": {}, "output_shape_type": "raw", "mode": "concat", "mode_type": "raw", "name": "mixed0"}, "inbound_nodes": [[["batchnormalization_6", 0, 0], ["batchnormalization_8", 0, 0], ["batchnormalization_11", 0, 0], ["batchnormalization_12", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_16", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_16", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_16", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_16", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_14", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_14", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 48, "bias": true}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_17", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_17", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 96, "bias": true}, "inbound_nodes": [[["batchnormalization_16", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_14", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_14", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_17", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_17", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_2", "config": {"strides": [1, 1], "dim_ordering": "tf", "name": "averagepooling2d_2", "trainable": true, "pool_size": [3, 3], "border_mode": "same"}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_13", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_13", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true}, "inbound_nodes": [[["mixed0", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_15", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_15", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 5, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true}, "inbound_nodes": [[["batchnormalization_14", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_18", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_18", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 96, "bias": true}, "inbound_nodes": [[["batchnormalization_17", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_19", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_19", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 32, "bias": true}, "inbound_nodes": [[["averagepooling2d_2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_13", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_13", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_15", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_15", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_18", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_18", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_19", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_19", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_19", 0, 0]]]}, {"class_name": "Merge", "name": "mixed1", "config": {"output_shape": null, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 3, "arguments": {}, "output_shape_type": "raw", "mode": "concat", "mode_type": "raw", "name": "mixed1"}, "inbound_nodes": [[["batchnormalization_13", 0, 0], ["batchnormalization_15", 0, 0], ["batchnormalization_18", 0, 0], ["batchnormalization_19", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_23", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_23", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_23", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_23", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_23", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_21", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_21", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 48, "bias": true}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_24", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_24", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 96, "bias": true}, "inbound_nodes": [[["batchnormalization_23", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_21", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_21", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_21", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_24", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_24", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_24", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_3", "config": {"strides": [1, 1], "dim_ordering": "tf", "name": "averagepooling2d_3", "trainable": true, "pool_size": [3, 3], "border_mode": "same"}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_20", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_20", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true}, "inbound_nodes": [[["mixed1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_22", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_22", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 5, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true}, "inbound_nodes": [[["batchnormalization_21", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_25", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_25", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 96, "bias": true}, "inbound_nodes": [[["batchnormalization_24", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_26", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_26", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 32, "bias": true}, "inbound_nodes": [[["averagepooling2d_3", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_20", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_20", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_20", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_22", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_22", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_22", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_25", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_25", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_25", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_26", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_26", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_26", 0, 0]]]}, {"class_name": "Merge", "name": "mixed2", "config": {"output_shape": null, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 3, "arguments": {}, "output_shape_type": "raw", "mode": "concat", "mode_type": "raw", "name": "mixed2"}, "inbound_nodes": [[["batchnormalization_20", 0, 0], ["batchnormalization_22", 0, 0], ["batchnormalization_25", 0, 0], ["batchnormalization_26", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_28", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_28", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true}, "inbound_nodes": [[["mixed2", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_28", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_28", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_28", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_29", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_29", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 96, "bias": true}, "inbound_nodes": [[["batchnormalization_28", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_29", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_29", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_29", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_27", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "name": "convolution2d_27", "activation": "relu", "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 384, "bias": true}, "inbound_nodes": [[["mixed2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_30", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "name": "convolution2d_30", "activation": "relu", "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 3, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 96, "bias": true}, "inbound_nodes": [[["batchnormalization_29", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_27", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_27", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_27", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_30", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_30", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_30", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_3", "config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "trainable": true, "pool_size": [3, 3], "border_mode": "valid"}, "inbound_nodes": [[["mixed2", 0, 0]]]}, {"class_name": "Merge", "name": "mixed3", "config": {"output_shape": null, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 3, "arguments": {}, "output_shape_type": "raw", "mode": "concat", "mode_type": "raw", "name": "mixed3"}, "inbound_nodes": [[["batchnormalization_27", 0, 0], ["batchnormalization_30", 0, 0], ["maxpooling2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_35", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_35", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 128, "bias": true}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_35", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_35", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_35", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_36", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_36", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 7, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 128, "bias": true}, "inbound_nodes": [[["batchnormalization_35", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_36", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_36", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_36", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_32", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_32", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 128, "bias": true}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_37", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 7, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_37", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 128, "bias": true}, "inbound_nodes": [[["batchnormalization_36", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_32", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_32", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_32", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_37", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_37", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_37", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_33", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 7, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_33", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 128, "bias": true}, "inbound_nodes": [[["batchnormalization_32", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_38", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_38", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 7, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 128, "bias": true}, "inbound_nodes": [[["batchnormalization_37", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_33", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_33", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_33", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_38", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_38", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_38", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_4", "config": {"strides": [1, 1], "dim_ordering": "tf", "name": "averagepooling2d_4", "trainable": true, "pool_size": [3, 3], "border_mode": "same"}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_31", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_31", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 192, "bias": true}, "inbound_nodes": [[["mixed3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_34", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_34", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 7, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 192, "bias": true}, "inbound_nodes": [[["batchnormalization_33", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_39", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 7, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_39", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 192, "bias": true}, "inbound_nodes": [[["batchnormalization_38", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_40", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_40", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 192, "bias": true}, "inbound_nodes": [[["averagepooling2d_4", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_31", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_31", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_31", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_34", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_34", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_34", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_39", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_39", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_39", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_40", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_40", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_40", 0, 0]]]}, {"class_name": "Merge", "name": "mixed4", "config": {"output_shape": null, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 3, "arguments": {}, "output_shape_type": "raw", "mode": "concat", "mode_type": "raw", "name": "mixed4"}, "inbound_nodes": [[["batchnormalization_31", 0, 0], ["batchnormalization_34", 0, 0], ["batchnormalization_39", 0, 0], ["batchnormalization_40", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_45", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_45", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_45", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_45", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_45", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_46", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_46", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 7, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": [[["batchnormalization_45", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_46", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_46", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_46", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_42", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_42", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_47", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 7, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_47", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": [[["batchnormalization_46", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_42", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_42", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_42", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_47", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_47", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_47", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_43", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 7, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_43", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": [[["batchnormalization_42", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_48", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_48", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 7, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": [[["batchnormalization_47", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_43", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_43", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_43", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_48", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_48", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_48", 0, 0]]]}, {"class_name": "AveragePooling2D", "name": "averagepooling2d_5", "config": {"strides": [1, 1], "dim_ordering": "tf", "name": "averagepooling2d_5", "trainable": true, "pool_size": [3, 3], "border_mode": "same"}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_41", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_41", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 192, "bias": true}, "inbound_nodes": [[["mixed4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_44", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_44", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 7, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 192, "bias": true}, "inbound_nodes": [[["batchnormalization_43", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_49", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 7, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_49", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 192, "bias": true}, "inbound_nodes": [[["batchnormalization_48", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_50", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_50", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 192, "bias": true}, "inbound_nodes": [[["averagepooling2d_5", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_41", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_41", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_41", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_44", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_44", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_44", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_49", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_49", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_49", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_50", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_50", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_50", 0, 0]]]}, {"class_name": "Merge", "name": "mixed5", "config": {"output_shape": null, "output_mask_type": "raw", "dot_axes": -1, "output_mask": null, "concat_axis": 3, "arguments": {}, "output_shape_type": "raw", "mode": "concat", "mode_type": "raw", "name": "mixed5"}, "inbound_nodes": [[["batchnormalization_41", 0, 0], ["batchnormalization_44", 0, 0], ["batchnormalization_49", 0, 0], ["batchnormalization_50", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_55", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_55", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": [[["mixed5", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_55", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_55", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_55", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_56", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_56", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 7, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": [[["batchnormalization_55", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_56", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_56", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_56", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_52", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_52", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": [[["mixed5", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_57", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 7, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_57", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": [[["batchnormalization_56", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_52", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_52", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_52", 0, 0]]]}, {"class_name": "BatchNormalization", "name": "batchnormalization_57", "config": {"beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_57", "trainable": true, "axis": 3, "mode": 0}, "inbound_nodes": [[["convolution2d_57", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_53", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 7, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_53", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 1, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": [[["batchnormalization_52", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_58", "config": {"b_constraint": null, "activity_regularizer": null, "nb_col": 1, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "name": "convolution2d_58", "activation": "relu", "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 7, "W_regularizer": {"name": "WeightRegularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "b_regularizer": null, "trainable": true, "nb_filter": 160, "bias": true}, "inbound_nodes": 